Repository: yulong000/YLCategory-Swift-MacOS-SPM
Catalog: Sources/YLShortcutView/Resources/*.lproj/Localizable.strings
Languages: es, fr, ja, ko, pt

source: Set shortcut keys
es: Configurar teclas de acceso
fr: Définir des raccourcis
ja: ショートカットキーを設定
ko: 단축키 설정
pt: Configurar atalhos

source: Click to edit
es: Haga clic para editar
fr: Cliquez pour modifier
ja: クリックして編集
ko: 클릭하여 편집
pt: Clique para editar

source: Enter shortcut keys
es: Introduzca los atajos
fr: Entrez les raccourcis
ja: ショートカットキーを入力
ko: 단축키를 입력하세요
pt: Insira os atalhos

source: Delete shortcut
es: Eliminar acceso directo
fr: Supprimer le raccourci
ja: ショートカットを削除
ko: 단축키 삭제
pt: Apagar o atalho

source: End editing
es: Terminar edición
fr: Terminer l'édition
ja: 編集を終了
ko: 편집 종료
pt: Terminar edição

source: Shortcut has been registered by system
es: El atajo ha sido registrado por el sistema
fr: Le raccourci a été enregistré par le système
ja: ショートカットはシステムによって登録されています
ko: 단축키가 시스템에 의해 등록되었습니다
pt: O atalho foi registrado pelo sistema

source: Control keys are unavailable
es: Las teclas de control no están disponibles
fr: Les touches de contrôle ne sont pas disponibles
ja: コントロールキーは利用できません
ko: 컨트롤 키를 사용할 수 없습니다
pt: As teclas de controle não estão disponíveis

source: Kind tips
es: Consejos Amables
fr: Conseils gentils
ja: 親切なヒント
ko: 친절한 안내
pt: Dicas amigáveis

source: Option Modifier Tips
es: Está usando 'Option +' como un acceso directo, y el sistema requiere permisos de accesibilidad para usarlo
fr: Vous utilisez 'Option +' comme raccourci, et le système nécessite des autorisations d'accessibilité pour l'utiliser
ja: 「Option +」をショートカットとして使用しています。システムがアクセシビリティの許可を必要としています
ko: 'Option +'을(를) 단축키로 사용하고 있습니다. 시스템에서 접근성 권한이 필요합니다
pt: Você está usando 'Option +' como atalho, e o sistema requer permissões de acessibilidade para usá-lo

source: Auth Accessibility
es: Otorgar permisos de accesibilidad
fr: Autoriser les permissions d'accessibilité
ja: アクセシビリティ権限を付与する
ko: 접근성 권한 부여
pt: Conceder permissões de acessibilidade

source: Clear Option Shortcuts
es: Borrar el acceso directo 'Option +'
fr: Effacer le raccourci 'Option +'
ja: 「Option +」ショートカットをクリア
ko: 'Option +' 단축키 지우기
pt: Limpar atalho 'Option +'

source: Accessibility Tips
es: Para registrar la tecla Opción como tecla modificadora, se requieren permisos de accesibilidad. Si ya están otorgados, elimínelos y vuelva a agregarlos.
fr: Pour enregistrer la touche Option comme touche de modification, les autorisations d’accessibilité sont requises. Si elles sont déjà accordées, veuillez les supprimer et les ajouter à nouveau.
ja: Optionキーを修飾キーとして登録するには、アクセシビリティの権限が必要です。権限が既に付与されている場合は、一度削除して再追加してください。
ko: Option 키를 수정 키로 등록하려면 접근성 권한이 필요합니다. 이미 권한이 부여된 경우, 제거한 후 다시 추가해 주세요.
pt: Para registrar a tecla Option como tecla modificadora, são necessárias permissões de acessibilidade. Se já estiverem concedidas, remova e adicione novamente.

source: To Authorize
es: Autorizar
fr: Autoriser
ja: 認可する
ko: 권한 부여
pt: Autorizar

source: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
